src/diary/2024-07-14.org
#+TITLE: ABC 362 / Splay tree
#+DATE: <2024-07-14 Sun>

* ABC 362

[[https://atcoder.jp/contests/abc362][ABC 362]] に参加しました。

#+CAPTION: 体感 Diff
| 問題 | A 問題 | B 問題 | C 問題 | D 問題 | E 問題 |
|------+--------+-------+--------+--------+-------|
| 予想 |    100 |   300 |    600 | 8,00   | 1,500 |
| 実際 |     12 |    66 |    521 | 634    | 1225  |

** [[https://atcoder.jp/contests/abc362/tasks/abc362_a][A 問題]]

指定色以外のペンの =min= を取ります。

#+BEGIN_SRC hs
main=interact$show.(f.map read.init<*>last).words;f[r,g,b](c:_)|c=='R'=0+min g b|c=='G'=min b r|0<1=min r g
#+END_SRC

** [[https://atcoder.jp/contests/abc362/tasks/abc362_b][B 問題]]

三平方の定理かベクトルの内積で直角三角形を判定します。内積は $a \cdot b = \sum_i a_i b_i = |a| |b| \cos (\angle (a - b))$ より $|a| \ne 0, |b| \ne 0$ ならば $\sum_i a_i b_i = 0$ で直角を判定できます。

前回も幾何でした。珍しい。

** [[https://atcoder.jp/contests/abc362/tasks/abc362_c][C 問題]]

Haskeller 的には難問です。解説も難しいのですが、一応書きました。

$\{[\mathcal{dl}_i, \mathcal{dr}_i]\}_i$ が与えられ、各ステップでは $[\mathcal{dl}_i, \mathcal{dr}_i]$ の範囲内で移動します。 =inRange (sum dls, sum drs) 0= が成り立つならば =0= で停止できます。 =0= で停止できるなら、各ステップの移動量を決めて行きます。

まず各ステップ $i$ で $\mathcal{dl}_i$ だけ移動するものとして、 =0= に近づくために必要な分だけ $\mathcal{dl}_i$ を $\mathcal{dr}_i$ に近づけていきます。この差分を $\mathcal{delta}_i$ とすると、 $\mathcal{delta}_i$ 列を求めて $\mathcal{dl}_i$ 列に加算することで解答できます。

$\mathcal{delta}_i$ を決めるためには、必要な正方向への移動量を状態に持って $\{[\mathcal{dl}_i, \mathcal{dr}_i]\}_i$ を走査すれば良いです。リストならば =mapAccumL= が、 =vector= ならば =mapM= + =State= モナドが使えます。再帰関数を作っても良いですね。

** [[https://atcoder.jp/contests/abc362/tasks/abc362_d][D 問題]]

$v_1$ と各点間の最短距離を求めます。 Dijkstra 法を実施したいのですが、辺と頂点の両方に重みがあります。解法は 2 つあります:

1. 頂点の重みを辺の重みに繰り込む
   辺を作るときに頂点の重みを加算しておきます。

2. 頂点倍化
   [[https://atcoder.jp/contests/abc362/editorial/10421][evima さんの解説]] です。 $v_{in}, v_{out}$ に分けることで、頂点の重みを辺に組み込めるとか。

Dijkstra 法は鉄則本やけんちょん本に載っています。枝刈りをお忘れなく！

** [[https://atcoder.jp/contests/abc362/tasks/abc362_e][E 問題]]

辛い……。 [[https://atcoder.jp/contests/abc362/submissions/55548303][2 ms]] ってどういうことなんですか？！

** [[https://atcoder.jp/contests/abc362/tasks/abc362_g][G 問題]]

苦手な文字列アルゴリズムです。 Suffix Array は最近作ったので upsolve したいです。

* Misc

** Splay tree

Link/cut tree に必要という splay tree を実装しました。

*** 主な情報源

以下から学びました。

- [[https://www.slideshare.net/slideshow/2013-spaceships2/17575244#137][Spaceships 解説]]
  概要を掴むのに最適です。計算量解析は飛ばします……。

- [[http://www.cs.cmu.edu/~sleator/papers/self-adjusting.pdf][Self-Adjusting Binary Search Trees]]
  元論文に top-down splaying の解説がありました。結局これが一番良さそうですね。

- [[https://github.com/sile/splay_tree][sile/splay\under{}tree]]
  Top-down splaying を行う splay tree です。内部データを密に保つため、 =delete= は =swap_remove= のような処理になっています。どうなんでしょう。

*** 用途

用途はありません。今のところ *ただの遅い木* です。遅延評価とか link/cut tree にして初めて使い道が生まれるのかと思います。 Link/cut tree への期待が高まります。

** なぜ =vector= の =concat= / =concatMap= は $O(N)$ なのか

=vector= の [[https://hackage.haskell.org/package/vector-0.13.1.0/docs/Data-Vector-Generic.html#v:concat][concat]] は $O(N)$ と書かれています。単純に =(++)= で畳み込むわけではないようです。たとえば =(++)= を使って長さ $1$ の配列の $N$ 個畳み込む場合、長さ $2, 3, \dots, N$ の配列が生成されて最悪計算量は $O(N^2)$ になります。

*** 結論

=MVector= を経由して上手いことやっています。

1. =concat= の場合
  最終配列長が事前に分かるとしています。長さ =n= の配列を作って埋めていきます。

2. =concatMap= の場合
  最終配列長が事前に分からないものとしています (なぜ？) 。適当な長さの配列を作り、サイズを倍々にして行くようです。 =concatMap= が $O(N)$ で済むのは、 Rust における N 回の =Vec::push= 呼び出しが $O(N)$ なのと似ています。実際、長さ $1, 2, 4, \dots, 2^k$ の配列を生成した場合、高々 $4N$ 程度のアロケーションしかありませんから、 $O(N)$ です。

