diary/2024-07-14.html
<!doctype html>
<html lang="ja">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>ABC 362 / Splay tree - toybeam</title>
    <meta name="description" content="devlog of toyboot4e" />
    <link rel="stylesheet" href="/style/simple.min.css" />
    <link rel="stylesheet" href="/style/style.css" />
    <link rel="stylesheet" href="/style/prism.css" />
    <!-- MathJax -->
  </head>
  <body>
    <header role="banner">
      <h1>ABC 362 / Splay tree</h1>
      <p>Jul 14, 2024</p>
      <nav role="navigation">
        <a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a>
      </nav>
    </header>
    <main role="main">
      <h2 id="ABC 362"><a href="#ABC 362">ABC 362</a></h2>
      <p><a href="https://atcoder.jp/contests/abc362">ABC 362</a> に参加しました。<br /></p>

      <table>
        <caption class="t-above">
          <span class="table-number">Table 1:</span>
          体感 Diff
        </caption>

        <colgroup>
          <col class="org-left" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">問題</th>
            <th scope="col" class="org-right">A 問題</th>
            <th scope="col" class="org-right">B 問題</th>
            <th scope="col" class="org-right">C 問題</th>
            <th scope="col" class="org-left">D 問題</th>
            <th scope="col" class="org-left">E 問題</th>
            <th scope="col" class="org-left">&#xa0;</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left">予想</td>
            <td class="org-right">100</td>
            <td class="org-right">300</td>
            <td class="org-right">600</td>
            <td class="org-left">8,00</td>
            <td class="org-left">2,000</td>
            <td class="org-left">1,500</td>
          </tr>

          <tr>
            <td class="org-left">実際</td>
            <td class="org-right">&#xa0;</td>
            <td class="org-right">&#xa0;</td>
            <td class="org-right">&#xa0;</td>
            <td class="org-left">&#xa0;</td>
            <td class="org-left">&#xa0;</td>
            <td class="org-left">&#xa0;</td>
          </tr>
        </tbody>
      </table>

      <h3 id="A 問題">
        <a href="#A 問題"><a href="https://atcoder.jp/contests/abc362/tasks/abc362_a">A 問題</a></a>
      </h3>
      <p>指定色以外のペンの <code>min</code> を取ります。<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-hs">main=interact$show.(f.map read.init&lt;*&gt;last).words;f[r,g,b](c:_)|c=='R'=0+min g b|c=='G'=min b r|0&lt;1=min r g
</code></pre>
      </div>

      <h3 id="B 問題">
        <a href="#B 問題"><a href="https://atcoder.jp/contests/abc362/tasks/abc362_b">B 問題</a></a>
      </h3>
      <p>
        三平方の定理かベクトルの内積で直角三角形を判定します。内積は \(a \cdot b = \sum_i a_i b_i =
        |a| |b| \cos (\angle (a - b))\) より \(|a| \ne 0, |b| \ne 0\) ならば \(\sum_i a_i b_i = 0\)
        で直角を判定できます。<br />
      </p>

      <p>前回も幾何でした。珍しい。<br /></p>

      <h3 id="C 問題">
        <a href="#C 問題"><a href="https://atcoder.jp/contests/abc362/tasks/abc362_c">C 問題</a></a>
      </h3>
      <p>Haskeller 的には難問です。解説も難しいのですが、一応書きました。<br /></p>

      <p>
        \(\{[\mathcal{dl}_i, \mathcal{dr}_i]\}_i\) が与えられ、各ステップでは \([\mathcal{dl}_i,
        \mathcal{dr}_i]\) の範囲内で移動します。
        <code>inRange (sum dls, sum drs) 0</code> が成り立つならば <code>0</code> で停止できます。
        <code>0</code> で停止できるなら、各ステップの移動量を決めて行きます。<br />
      </p>

      <p>
        まず各ステップ \(i\) で \(\mathcal{dl}_i\) だけ移動するものとして、
        <code>0</code> に近づくために必要な分だけ \(\mathcal{dl}_i\) を \(\mathcal{dr}_i\)
        に近づけていきます。この差分を \(\mathcal{delta}_i\) とすると、 \(\mathcal{delta}_i\)
        列を求めて \(\mathcal{dl}_i\) 列に加算することで解答できます。<br />
      </p>

      <p>
        \(\mathcal{delta}_i\) を決めるためには、必要な正方向への移動量を状態に持って
        \(\{[\mathcal{dl}_i, \mathcal{dr}_i]\}_i\) を走査すれば良いです。リストならば
        <code>mapAccumL</code> が、 <code>vector</code> ならば <code>mapM</code> +
        <code>State</code> モナドが使えます。再帰関数を作っても良いですね。<br />
      </p>

      <h3 id="D 問題">
        <a href="#D 問題"><a href="https://atcoder.jp/contests/abc362/tasks/abc362_d">D 問題</a></a>
      </h3>
      <p>
        \(v_1\) と各点間の最短距離を求めます。 Dijkstra
        法を実施したいのですが、辺と頂点の両方に重みがあります。解法は 2 つあります:<br />
      </p>

      <ol>
        <li>
          頂点の重みを辺の重みに繰り込む<br />
          辺を作るときに頂点の重みを加算しておきます。<br />
        </li>

        <li>
          頂点倍化<br />
          <a href="https://atcoder.jp/contests/abc362/editorial/10421">evima さんの解説</a> です。
          \(v_{in}, v_{out}\) に分けることで、頂点の重みを辺に組み込めるとか。<br />
        </li>
      </ol>

      <p>Dijkstra 法は鉄則本やけんちょん本に載っています。枝刈りをお忘れなく！<br /></p>

      <h3 id="E 問題">
        <a href="#E 問題"><a href="https://atcoder.jp/contests/abc362/tasks/abc362_e">E 問題</a></a>
      </h3>
      <p>
        辛い……。
        <a href="https://atcoder.jp/contests/abc362/submissions/55548303">2 ms</a>
        ってどういうことなんですか？！<br />
      </p>

      <h3 id="G 問題">
        <a href="#G 問題"><a href="https://atcoder.jp/contests/abc362/tasks/abc362_g">G 問題</a></a>
      </h3>
      <p>苦手な文字列アルゴリズムです。 Suffix Array は最近作ったので upsolve したいです。<br /></p>

      <h2 id="Misc"><a href="#Misc">Misc</a></h2>
      <h3 id="Splay tree"><a href="#Splay tree">Splay tree</a></h3>
      <p>Link/cut tree に必要という splay tree を実装しました。<br /></p>

      <h4 id="主な情報源"><a href="#主な情報源">主な情報源</a></h4>
      <p>以下から学びました。<br /></p>

      <ul>
        <li>
          <a href="https://www.slideshare.net/slideshow/2013-spaceships2/17575244#137"
            >Spacesihps 解説</a
          ><br />
          概要を掴むのに最適です。計算量解析は飛ばします……。<br />
        </li>

        <li>
          <a href="http://www.cs.cmu.edu/~sleator/papers/self-adjusting.pdf"
            >Self-Adjusting Binary Search Trees</a
          ><br />
          元論文に top-down splaying の解説がありました。結局これが一番良さそうですね。<br />
        </li>

        <li>
          <a href="https://github.com/sile/splay_tree">sile/splay_tree</a><br />
          Top-down splaying を行う splay tree です。内部データを密に保つため、
          <code>delete</code> は
          <code>swap_remove</code> のような処理になっています。どうなんでしょう。<br />
        </li>
      </ul>

      <h4 id="用途"><a href="#用途">用途</a></h4>
      <p>
        ありません。今のところ <strong>ただの遅い木</strong> です。遅延評価とか link/cut tree
        にして初めて使い道が生まれるのかと思います。 Link/cut tree への期待が高まります。<br />
      </p>

      <h3 id="なぜ vector の concat / concatMap は \(O(N)\) なのか">
        <a href="#なぜ vector の concat / concatMap は \(O(N)\) なのか"
          >なぜ <code>vector</code> の <code>concat</code> / <code>concatMap</code> は \(O(N)\)
          なのか</a
        >
      </h3>
      <p>
        <code>vector</code> の
        <a
          href="https://hackage.haskell.org/package/vector-0.13.1.0/docs/Data-Vector-Generic.html#v:concat"
          >concat</a
        >
        は \(O(N)\) と書かれています。単純に
        <code>(++)</code> で畳み込むわけではないようです。たとえば <code>(++)</code> を使って長さ
        \(1\) の配列の \(N\) 個畳み込む場合、長さ \(2, 3, \dots, N\) の配列が生成されて最悪計算量は
        \(O(N^2)\) になります。<br />
      </p>

      <h4 id="結論"><a href="#結論">結論</a></h4>
      <p><code>MVector</code> を経由して上手いことやっています。<br /></p>

      <ol>
        <li>
          <code>concat</code> の場合<br />
          最終配列長が事前に分かるとしています。長さ
          <code>n</code> の配列を作って埋めていきます。<br />
        </li>

        <li>
          <code>concatMap</code> の場合<br />
          最終配列長が事前に分からないものとしています (なぜ？)
          。適当な長さの配列を作り、サイズを倍々にして行くようです。 <code>concatMap</code> が
          \(O(N)\) で済むのは、 Rust における N 回の <code>Vec::push</code> 呼び出しが \(O(N)\)
          なのと似ています。実際、長さ \(1, 2, 4, \dots, 2^k\) の配列を生成した場合、高々 \(4N\)
          程度のアロケーションしかありませんから、 \(O(N)\) です。<br />
        </li>
      </ol>
