diary/2024-07-14.html

      <h4 id="unstream">
        <a href="#unstream"><code>unstream</code></a>
      </h4>
      <p>
        <a
          href="https://hackage.haskell.org/package/vector-0.13.1.0/docs/Data-Vector-Generic.html#v:concat"
          >concat</a
        >
        の中身を見ると、 <code>New.unstream</code> によって実装されています。
        <code>unstream</code> 処理を追っていきましょう。<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-hs">-- | /O(n)/ Concatenate all vectors in the list.
concat :: Vector v a =&gt; [v a] -&gt; v a
{-# INLINE concat #-}
concat = unstream . Bundle.fromVectors
</code></pre>
      </div>

      <details>
        <summary><code>concat</code> の関数呼び出しを辿る</summary>
        <div class="org-src-container">
          <label class="org-src-name"
            ><span class="listing-number">Listing 1: </span><code>Generic.hs</code></label
          >
          <pre><code class="src language-hs">-- | /O(n)/ Construct a vector from a 'Bundle'.
unstream :: Vector v a =&gt; Bundle v a -&gt; v a
{-# INLINE unstream #-}
unstream s = new (New.unstream s)

-- | Construct a vector from a monadic initialiser.
new :: Vector v a =&gt; New v a -&gt; v a
{-# INLINE_FUSED new #-}
new m = m `seq` runST (unsafeFreeze =&lt;&lt; New.run m)
</code></pre>
        </div>

        <p><code>New.unstream</code> は <code>MVector.vunstream</code> を呼んでいます。<br /></p>

        <div class="org-src-container">
          <label class="org-src-name"
            ><span class="listing-number">Listing 2: </span><code>New.hs</code></label
          >
          <pre><code class="src language-hs">-- ほぼ `MVector`
data New v a = New (forall s. ST s (Mutable v s a))

unstream :: Vector v a =&gt; Bundle v a -&gt; New v a
{-# INLINE_FUSED unstream #-}
unstream s = s `seq` New (MVector.vunstream s)
</code></pre>
        </div>

        <p>さらに追いかけます。<br /></p>

        <div class="org-src-container">
          <label class="org-src-name"
            ><span class="listing-number">Listing 3: </span><code>Mutable.hs</code></label
          >
          <pre><code class="src language-hs">-- | Create a new mutable vector and fill it with elements from the 'Bundle'.
-- The vector will grow exponentially if the maximum size of the 'Bundle' is
-- unknown.
vunstream :: (PrimMonad m, V.Vector v a)
         =&gt; Bundle v a -&gt; m (V.Mutable v (PrimState m) a)
-- NOTE: replace INLINE_FUSED by INLINE? (also in unstreamR)
{-# INLINE_FUSED vunstream #-}
vunstream s = vmunstream (Bundle.lift s)
</code></pre>
        </div>
      </details>

      <p>
        結局 <code>Mutable</code> モジュールの <code>vmunstream</code> を呼び出しており、これは
        bundle の最大サイズが事前に分かるかで分岐しています。<br />
      </p>

      <div class="org-src-container">
        <label class="org-src-name"
          ><span class="listing-number">Listing 4: </span><code>Mutable.hs</code></label
        >
        <pre><code class="src language-hs">-- | Create a new mutable vector and fill it with elements from the monadic
-- stream. The vector will grow exponentially if the maximum size of the stream
-- is unknown.
vmunstream :: (PrimMonad m, V.Vector v a)
           =&gt; MBundle m v a -&gt; m (V.Mutable v (PrimState m) a)
{-# INLINE_FUSED vmunstream #-}
vmunstream s = case upperBound (MBundle.size s) of
               Just n  -&gt; vmunstreamMax     s n
               Nothing -&gt; vmunstreamUnknown s
</code></pre>
      </div>

      <p>
        サイズ <code>n</code> が事前に分かる場合は、長さ <code>n</code> の
        <code>MVector</code> を作って埋めていきます。これが <code>concat</code> の場合です。<br />
      </p>

      <details>
        <summary><code>vmunsteramMax</code>: bundle の最大サイズが事前に分かっている場合</summary>
        <div class="org-src-container">
          <pre><code class="src language-hs">vmunstreamMax :: (PrimMonad m, V.Vector v a)
              =&gt; MBundle m v a -&gt; Int -&gt; m (V.Mutable v (PrimState m) a)
{-# INLINE vmunstreamMax #-}
vmunstreamMax s n
  = do
      v &lt;- checkLength Internal n $ unsafeNew n
      let {-# INLINE_INNER copyChunk #-}
          copyChunk i (Chunk m f) =
            checkSlice Internal i m (length v) $ do
              f (basicUnsafeSlice i m v)
              return (i+m)

      n' &lt;- Stream.foldlM' copyChunk 0 (MBundle.chunks s)
      return $ checkSlice Internal 0 n' n
             $ unsafeSlice 0 n' v
</code></pre>
        </div>
      </details>

      <p>
        サイズが不明の場合は、 <code>MVector</code> のサイズを倍々に増やしつつ埋めていきます。これが
        <code>concatMap</code> の場合です。<br />
      </p>

      <details>
        <summary><code>vmunstreamUnknown</code>: bundle の最大サイズが事前に分からない場合</summary>
        <div class="org-src-container">
          <pre><code class="src language-hs">vmunstreamUnknown :: (PrimMonad m, V.Vector v a)
                 =&gt; MBundle m v a -&gt; m (V.Mutable v (PrimState m) a)
{-# INLINE vmunstreamUnknown #-}
vmunstreamUnknown s
  = do
      v &lt;- unsafeNew 0
      (v', n) &lt;- Stream.foldlM copyChunk (v,0) (MBundle.chunks s)
      return $ checkSlice Internal 0 n (length v')
             $ unsafeSlice 0 n v'
  where
    {-# INLINE_INNER copyChunk #-}
    copyChunk (v,i) (Chunk n f)
      = do
          let j = i+n
          v' &lt;- if basicLength v &lt; j
                  then unsafeGrow v (delay_inline max (enlarge_delta v) (j - basicLength v))
                  else return v
          checkSlice Internal i n (length v') $ f (basicUnsafeSlice i n v')
          return (v',j)
</code></pre>
        </div>
      </details>

      <h4 id=""><a href="#"></a></h4>
      <h4 id="concat の計算量">
        <a href="#concat の計算量"><code>concat</code> の計算量</a>
      </h4>
      <p>
        <code>concat</code> はサイズが <code>Exact n</code> の <code>Bundle</code> を作って
        <code>unstream</code> にかけています。<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-hs">-- | /O(n)/ Concatenate all vectors in the list.
concat :: Vector v a =&gt; [v a] -&gt; v a
{-# INLINE concat #-}
concat = unstream . Bundle.fromVectors
</code></pre>
      </div>

      <p>
        Fusion
        関係のコードは読み込めていませんが、ひとまずサイズ指定の部分だけ見れば良いかと思います
        (<code>Exact n</code> です) 。<br />
      </p>

      <details>
        <summary>
          <code>Data/Vector/Fusion/Bundle/Monadic.hs</code>
        </summary>
        <div class="org-src-container">
          <pre><code class="src language-hs">fromVectors :: forall m v a. (Monad m, Vector v a) =&gt; [v a] -&gt; Bundle m v a
{-# INLINE_FUSED fromVectors #-}
fromVectors us = Bundle (Stream pstep (Left us))
                        (Stream vstep us)
                        Nothing
                        (Exact n) -- ***** これ
  where
    n = List.foldl' (\k v -&gt; k + basicLength v) 0 us

    pstep (Left []) = return Done
    pstep (Left (v:vs)) = basicLength v `seq` return (Skip (Right (v,0,vs)))

    pstep (Right (v,i,vs))
      | i &gt;= basicLength v = return $ Skip (Left vs)
      | otherwise          = case basicUnsafeIndexM v i of
                               Box x -&gt; return $ Yield x (Right (v,i+1,vs))

    -- FIXME: work around bug in GHC 7.6.1
    vstep :: HasCallStack =&gt; [v a] -&gt; m (Step [v a] (Chunk v a))
    vstep [] = return Done
    vstep (v:vs) = return $ Yield (Chunk (basicLength v)
                                         (\mv -&gt; check
                                                 Internal
                                                 "length mismatch"
                                                 (M.basicLength mv == basicLength v)
                                                 $ stToPrim $ basicUnsafeCopy mv v)) vs
</code></pre>
        </div>
      </details>
