src/diary/2024-07-14.org
*** =concatMap= の計算量

[[https://hackage.haskell.org/package/vector-0.13.1.0/docs/Data-Vector-Generic.html#v:concatMap][concatMap]] はサイズ =Unknown= の =Bundle= を作って =unstream= にかけています。

#+BEGIN_SRC hs
-- | Map a function over a vector and concatenate the results.
concatMap :: (Vector v a, Vector v b) => (a -> v b) -> v a -> v b
{-# INLINE concatMap #-}
-- NOTE: We can't fuse concatMap anyway so don't pretend we do.
-- ..
concatMap f = unstream
            . Bundle.concatVectors
            . Bundle.map f
            . stream
#+END_SRC

=Bundle= のサイズは =Unknown= です。

#+BEGIN_DETAILS =Data/Vector/Fusion/Bundle/Monadic.hs=
#+BEGIN_SRC hs
concatVectors :: (Monad m, Vector v a) => Bundle m u (v a) -> Bundle m v a
{-# INLINE_FUSED concatVectors #-}
concatVectors Bundle{sElems = Stream step t}
  = Bundle (Stream pstep (Left t))
           (Stream vstep t)
           Nothing
           Unknown -- ***** これ
  where
    pstep (Left s) = do
      r <- step s
      case r of
        Yield v s' -> basicLength v `seq` return (Skip (Right (v,0,s')))
        Skip    s' -> return (Skip (Left s'))
        Done       -> return Done

    pstep (Right (v,i,s))
      | i >= basicLength v = return (Skip (Left s))
      | otherwise          = case basicUnsafeIndexM v i of
                               Box x -> return (Yield x (Right (v,i+1,s)))


    vstep s = do
      r <- step s
      case r of
        Yield v s' -> return (Yield (Chunk (basicLength v)
                                           (\mv -> check
                                                   Internal
                                                   "length mismatch"
                                                   (M.basicLength mv == basicLength v)
                                                   $ stToPrim $ basicUnsafeCopy mv v)) s')
        Skip    s' -> return (Skip s')
        Done       -> return Done
#+END_SRC
#+END_DETAILS

*** =vconcatMapN=

上記 =concatMap= において、 =Bundle= のサイズ指定を =Unknown= から =Exact n= に変更してみました。が、実行速度には無影響でした。

- [[https://atcoder.jp/contests/abc362/submissions/55535867][=concatMap= を使った場合: 143 ms]]
- [[https://atcoder.jp/contests/abc362/submissions/55594325][=vconcatMap= を使った場合: 144 ms]]

なぜでしょう？　まあ問題無く使って行けそうです。

** SNS 情報

- [[https://audee.jp/program/show/300008578][vim-jp ラジオ]] 爆誕
  めでたい！

- [[https://sktgroup.co.jp/go7/][Boox Go Color 7]]
  7 インチの色付き E-Ink 端末です。 _It just works_ ということで良さそうですが、 7 インチなのでパスです。 Kindle Scribe が色付きになると、大型技術書を色付きで読めて嬉しいのですが。

*** Emacs

- [[https://github.com/oantolin/embark][oantolin/embark]]
  ポスト =completing-read= 時代の人気パッケージです。 =find-file= で選んだファイルを [[https://github.com/abo-abo/ace-window][abo-abo/ace-window]] で指定したウィンドウで開く ([[https://karthinks.com/software/fifteen-ways-to-use-embark/#:~:text=to%20suitable%20keys.-,Open%20any%20buffer%20by%20splitting%20any%20window,-This%20needs%20a][記事]]) など、活用できると良さそうですね。

- [[https://github.com/blahgeek/emacs-lsp-booster][slotThe/emacs-lsp-booster]], [[https://github.com/slotThe/emacs-lsp-booster-flake][slotThe/emacs-lsp-booster-flake]]
  LSP のメッセージ処理を並列処理にすることで、 =lsp-mode= も [[https://github.com/manateelazycat/lsp-bridge][lsp-bridge]] 並に速くなるとか。ひとまず入れました。

** DTM

*** PC

先々週に買った PC ですが、購買を間違えました。やはりパソコンに疎いようです。

- Intel の 13, 14 世代 CPU は発熱の問題が [[https://gazlog.jp/entry/intel-cpu-degrade-issue/][非常に深刻だった]]
  ひとまず BIOS を更新して推奨設定にすれば問題無いと思いたいですが……。

- SSD の開発元が怪しかった
  幸い (?) 初期不良なので返品します。公式サイトが http なのは何とかしてほしいですね……。次は高級ブランド (Samsung) から買っておけば大丈夫でしょう。

*** ギター (ど下手)

急に 160 BPS の 16 分音符が弾けるようになりました (単弦に限る) 。手首というより、指でピッキングして良いことを理解しました。たぶん。

トレモロの音が出せると色々遊べてデカいですが、どうでしょう。 SSD 到着待ちです。

