diary/2024-07-14.html

      <h4 id="concatMap の計算量">
        <a href="#concatMap の計算量"><code>concatMap</code> の計算量</a>
      </h4>
      <p>
        <a
          href="https://hackage.haskell.org/package/vector-0.13.1.0/docs/Data-Vector-Generic.html#v:concatMap"
          >concatMap</a
        >
        はサイズ <code>Unknown</code> の <code>Bundle</code> を作って
        <code>unstream</code> にかけています。<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-hs">-- | Map a function over a vector and concatenate the results.
concatMap :: (Vector v a, Vector v b) =&gt; (a -&gt; v b) -&gt; v a -&gt; v b
{-# INLINE concatMap #-}
-- NOTE: We can't fuse concatMap anyway so don't pretend we do.
-- ..
concatMap f = unstream
            . Bundle.concatVectors
            . Bundle.map f
            . stream
</code></pre>
      </div>

      <p><code>Bundle</code> のサイズは <code>Exact n</code> です。<br /></p>

      <details>
        <summary>
          <code>Data/Vector/Fusion/Bundle/Monadic.hs</code>
        </summary>
        <div class="org-src-container">
          <pre><code class="src language-hs">concatVectors :: (Monad m, Vector v a) =&gt; Bundle m u (v a) -&gt; Bundle m v a
{-# INLINE_FUSED concatVectors #-}
concatVectors Bundle{sElems = Stream step t}
  = Bundle (Stream pstep (Left t))
           (Stream vstep t)
           Nothing
           Unknown -- ***** これ
  where
    pstep (Left s) = do
      r &lt;- step s
      case r of
        Yield v s' -&gt; basicLength v `seq` return (Skip (Right (v,0,s')))
        Skip    s' -&gt; return (Skip (Left s'))
        Done       -&gt; return Done

    pstep (Right (v,i,s))
      | i &gt;= basicLength v = return (Skip (Left s))
      | otherwise          = case basicUnsafeIndexM v i of
                               Box x -&gt; return (Yield x (Right (v,i+1,s)))


    vstep s = do
      r &lt;- step s
      case r of
        Yield v s' -&gt; return (Yield (Chunk (basicLength v)
                                           (\mv -&gt; check
                                                   Internal
                                                   "length mismatch"
                                                   (M.basicLength mv == basicLength v)
                                                   $ stToPrim $ basicUnsafeCopy mv v)) s')
        Skip    s' -&gt; return (Skip s')
        Done       -&gt; return Done
</code></pre>
        </div>
      </details>

      <h4 id="vconcatMapN">
        <a href="#vconcatMapN"><code>vconcatMapN</code></a>
      </h4>
      <p>
        上記 <code>concatMap</code> において、 <code>Bundle</code> のサイズ指定を
        <code>Unknown</code> から
        <code>Exact n</code> に変更してみました。が、実行速度には無影響でした。<br />
      </p>

      <ul>
        <li>
          <a href="https://atcoder.jp/contests/abc362/submissions/55535867"
            ><code>concatMap</code> を使った場合: 143 ms</a
          ><br />
        </li>
        <li>
          <a href="https://atcoder.jp/contests/abc362/submissions/55594325"
            ><code>vconcatMap</code> を使った場合: 144 ms</a
          ><br />
        </li>
      </ul>

      <p>なぜでしょう？　まあ問題無く使って行けそうです。<br /></p>

      <h3 id="SNS 情報"><a href="#SNS 情報">SNS 情報</a></h3>
      <ul>
        <li>
          <a href="https://audee.jp/program/show/300008578">vim-jp ラジオ</a> 爆誕<br />
          めでたい！<br />
        </li>

        <li>
          <a href="https://sktgroup.co.jp/go7/">Boox Go Color 7</a><br />
          7 インチの色付き E-Ink 端末です。
          <span class="underline">It just works</span> ということで良さそうですが、 7
          インチなのでパスです。 Kindle Scribe
          が色付きになると、大型技術書を色付きで読めて嬉しいのですが。<br />
        </li>
      </ul>

      <h4 id="Emacs"><a href="#Emacs">Emacs</a></h4>
      <ul>
        <li>
          <a href="https://github.com/oantolin/embark">oantolin/embark</a><br />
          ポスト <code>completing-read</code> 時代の人気パッケージです。
          <code>find-file</code> で選んだファイルを
          <a href="https://github.com/abo-abo/ace-window">abo-abo/ace-window</a>
          で指定したウィンドウで開く (<a
            href="https://karthinks.com/software/fifteen-ways-to-use-embark/#:~:text=to%20suitable%20keys.-,Open%20any%20buffer%20by%20splitting%20any%20window,-This%20needs%20a"
            >記事</a
          >) など、活用できると良さそうですね。<br />
        </li>

        <li>
          <a href="https://github.com/blahgeek/emacs-lsp-booster">slotThe/emacs-lsp-booster</a>,
          <a href="https://github.com/slotThe/emacs-lsp-booster-flake"
            >slotThe/emacs-lsp-booster-flake</a
          ><br />
          LSP のメッセージ処理を並列処理にすることで、 <code>lsp-mode</code> も
          <a href="https://github.com/manateelazycat/lsp-bridge">lsp-bridge</a>
          並に速くなるとか。ひとまず入れました。<br />
        </li>
      </ul>

      <h3 id="DTM"><a href="#DTM">DTM</a></h3>
      <h4 id="PC"><a href="#PC">PC</a></h4>
      <p>先々週に買った PC ですが、購買を間違えました。やはりパソコンに疎いようです。<br /></p>

      <ul>
        <li>
          Intel の 13, 14 世代 CPU は発熱の問題が
          <a href="https://gazlog.jp/entry/intel-cpu-degrade-issue/">非常に深刻だった</a><br />
          ひとまず BIOS を更新して推奨設定にすれば問題無いと思いたいですが……。<br />
        </li>

        <li>
          SSD の開発元が怪しかった<br />
          幸い (?) 初期不良なので返品します。公式サイトが http
          なのは何とかしてほしいですね……。次は高級ブランド (Sumsung)
          から買っておけば大丈夫でしょう。<br />
        </li>
      </ul>

      <h4 id="ギター (ど下手)"><a href="#ギター (ど下手)">ギター (ど下手)</a></h4>
      <p>
        急に 160 BPS の 16 分音符が弾けるようになりました (単弦に限る)
        。手首というより、指でピッキングして良いことを理解しました。たぶん。<br />
      </p>

      <p>トレモロの音が出せると色々遊べてデカいですが、どうでしょう。 SSD 到着待ちです。<br /></p>
    </main>
    <footer role="contentinfo">
      <p>Styled with <a href="https://simplecss.org/">Simple.css</a></p>
      <div><a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div>
    </footer>
  </body>
</html>
